{"id": 271074679416950785, "name": "Second review of TMUX README", "description": "Final review of TMUX integration README focusing on readability, user experience, and documentation quality. Polish language, improve formatting, and ensure all use cases are covered.", "status": "plan", "next_chore_id": null, "progress_info": null, "review_info": null}
{"id": 271077396713574400, "name": "Fix chore chaining system", "description": "The chore chaining system is not working correctly. When a chore is completed, the next_chore should automatically become available but the chain is broken. Need to implement proper chore chain activation when parent chore reaches WORK_DONE status.", "status": "design", "next_chore_id": null, "progress_info": null, "review_info": null}
{"id": 271079664666021889, "name": "Implement ArchivalManager system", "description": "Create ArchivalManager with location validation, cleanup utilities, and single-location existence enforcement. Ensure completed chores move to archive automatically.", "status": "work_done", "next_chore_id": null, "progress_info": "Implemented ArchivalManager with cleanup_duplicates, archive_completed_chore, and atomic file operations. System now maintains clean separation between active and completed chores.", "review_info": "ArchivalManager complete and tested. System integrity validation passing with proper chore location management."}
{"id": 271079664666021890, "name": "Implement ChainActivationEngine", "description": "Create ChainActivationEngine with chain validation, next chore activation on completion, and complex chain scenario handling.", "status": "design", "next_chore_id": null, "progress_info": null, "review_info": null}
{"id": 271079664666021891, "name": "Integrate lifecycle manager with existing system", "description": "Update ChoreRepository to use ChoreLifecycleManager, modify MCP server, update tests, and add monitoring/diagnostics.", "status": "design", "next_chore_id": null, "progress_info": null, "review_info": null}
